# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
"""Вариант 1"""
# n = int(input('Введите число: '))
# list = [1]
# for i in range (1, n):
#     list.append ((i+1) * list [i-1])
# print(list)

"""Вариант 2"""
n = int(input('Введите число: '))
a = 1
for i in range(n):
    i = i + 1
    a = i * a
    print(a, end = ', ')

